#!/bin/bash
#указываем где у нас хранится bash-интерпретатор

##############################################
par1=$1 #значение первого параметра скрипта
par2=$2 #значение второго параметра скрипта 
script_name=$0 #значение имени скрипта
##############################################
echo "Дата и Время: $(date)"
##############################################
echo "Вы запустили скрипт 
с именем $script_name,
содержимое папки $DIRSTACK :"
##############################################
ls
##############################################
echo "
c домашней директорией $HOME,
с hostname = $HOSTNAME,
параметры $*"
echo ""
##############################################
if [ "$par1" -eq "$par2" ] 
then
echo "source = destination"
echo "Error. Look at log.txt."
echo "Они равны: source = destination" > log.txt
exit 1
elif [ "$par1" -eq "1" -a "$par2" -eq "2" ]
then
echo "Ты всегда будешь набирать: 1 2. М?"
./q
elif [ "$par1" -eq "1" -a "$par2" -eq "3" ]
then
echo "Ого, это не 1 2. Это 1 3. Молоток!"
else
echo "Exacution of CP from to"
cp $par1 $par2
echo "Удачное копирование!"
fi
##############################################
echo ""
echo "Запустить редактор nano?"
echo "1 Запуск nano"
echo "2 Выход"
echo "3 Дальше"
echo "0 Заново"

read doing 

case $doing in
1)
/usr/bin/nano
;;
2)
exit 0
;;
3)
echo "Далее:"
echo ""
;;
0)
echo "Запускаем заново скрипт c теми же параметрами"
echo ""
echo "##############################################"
echo ""
/home/san/bash_scripts/bash.sh $par1 $par2
;;
*)
echo "Введено неправильное действие!"
esac
##############################################
if [ "$par1" -ne "1" ]
then
	echo "Ура! Параметр1 не 1"
else
	echo "Эх ты, Параметр1 это 1"
fi
##############################################
exit 0